export const chatbotTexts = {
  welcomeTitle: "مرحبا انا مساعدك الذكي سند. 👋",
  welcomeMessage: "كيف يمكنني مساعدتك اليوم?",

  toggleTitle: "تحدث مع سند",
  headerTitle: "سند",
  headerSubtitle: "دعم ذكي",

  typingLabel: "سند • يكتب الان...",
  botLabel: (timestamp: string) => `سند • ${timestamp}`,

  placeholder: "أسال اي شيئ...",

  suggestedIntro: "اسئلة مقترحة:",
  suggestedQuestions: [
    "كيف يمكنني حجز جلسة مع طبيب معين؟",
    "ما الفائدة من الاختبارات النفسية؟",
    "ما هي منصة سند؟"
  ],

  autoReplies: {
    "كيف يمكنني حجز جلسة مع طبيب معين؟":
      "يمكنك انشاء حساب من زر ابدا الان الموجود في اعلى يسار الشاشة, ومن ثم الدخول الى لوحة التحكم الخاصة بك->جلساتي->اضافة جلسة",

    "ما الفائدة من الاختبارات النفسية؟":
      "الاختبارات النفسية تساعدك على تشخيص وتحديد ما اذا كنت في مرحلة خطر تطلب منك البدء في تلقي العلاج ام لا, كما انها تساعد الاطباء على التعرف على سلوك مرضاهم بشكل افضل و فهم طبيعة شخصياتهم",

    "ما هي منصة سند؟":
      "منصة سند هي منصة خدمية تسعى لتقديم الدعم لجميع الناس وفي اي مكان كانو, تعمل منصة سند على تقديم الدعم النفسي و زيادة الوعي بالصحة النفسية من خلال نشر العديد من المقالات المتعلقة بالصحة النفسية ومن خلال الاستخدام الامثل للوسائط المتعددة لدعم الاشخاص, يمكنك زيارة صفحة المكتبة و قراءة بعض المقالات لكي تتعرف اكثر على سند.",
  },
};