// src/data/faqData.ts

export interface FAQItem {
  id: number;
  question: string;
  answer: string;
}

const faqData: FAQItem[] = [
  {
    id: 1,
    question: "ما هي منصة سند؟",
    answer: "منصة سند هي منصة تقدم خدمات دعم نفسي واستشارات علاجية عبر الإنترنت بطريقة آمنة وسرية."
  },
  {
    id: 2,
    question: "كيف يمكنني حجز موعد مع مختص؟",
    answer: "يمكنك الحجز عبر واجهة الحجز في الموقع، واختيار الموعد والمختص الذي يناسبك."
  },
  {
    id: 3,
    question: "كم مدة الجلسة",
    answer: "مدة الجلسة سواء كانت مع اخصائي نفسي او مع طبيب نفسي هي 45 دقيقة وقد تمتد لبعض الاحيان الى ساعة كحد اقصى"
  },
  {
    id: 4,
    question: "كم جلسة احتاج للعلاج؟",
    answer: "يختلف عدد جلسات العلاج باختلاف الحالة والتشخيص , لكن بشكل عام بان عدة عوامي تساعد في التحسن بشكل اسرع."
  },
  {
    id: 5,
    question: "هل المعالج الخاص بي هو اخصائي نفسي ام طبيب نفسي؟",
    answer: "يتم تحديد المختص الخاص بك سواء كان طبيبا ام معالجا مختصا بناءا على حالتك وعلى تقدير الطبيب المشرف عنك"
  },
  {
    id: 6,
    question: "هل يوجد باقات اشتراك؟",
    answer: "نعم، نوفر باقات مختلفة لتناسب احتياجاتك سواء فردية أو عائلية."
  },
  {
    id: 7,
    question: "كيف أختار المختص المناسب لي؟",
    answer: "من خلال قراءة الملف التعريفي لكل مختص والمراجعات من مستخدمين سابقين."
  },
  {
    id: 8,
    question: "هل يمكن تغيير المختص بعد الحجز؟",
    answer: "نعم، يمكنك تغيير المختص من خلال إعدادات حسابك أو التواصل مع الدعم الفني."
  },
  {
    id: 9,
    question: "ما هو العلاج السلوكي المعرفي؟",
    answer: "العلاج السلوكي المعرفي (CBT) هو أحد أنواع العلاج النفسي الذي يركّز على العلاقة بين الأفكار والمشاعر والسلوكيات. يهدف إلى مساعدة الفرد على التعرف على أنماط التفكير السلبية واستبدالها بأفكار أكثر واقعية وإيجابية. يُستخدم لعلاج العديد من الاضطرابات النفسية مثل الاكتئاب والقلق والوسواس القهري"
  },
  {
    id: 10,
    question: "هل هناك دعم طارئ؟",
    answer: "نعم، يتوفر دعم لحالات الطوارئ النفسية على مدار الساعة."
  },
  {
    id: 11,
    question: "هل المنصة مناسبة للمراهقين؟",
    answer: "نعم، لدينا مختصين في علاج اليافعين والمراهقين."
  },
  {
    id: 12,
    question: "كيف يتم التعامل مع معلوماتي؟",
    answer: "نحن نأخذ خصوصيتك على محمل الجد. يتم التعامل مع جميع معلوماتك الشخصية والصحية بسرية تامة وفقًا لأعلى معايير الأمان والخصوصية. لا يتم مشاركة أي بيانات مع أطراف ثالثة دون موافقتك الصريحة، ويتم تخزين معلوماتك باستخدام تقنيات تشفير وحماية متقدمة لضمان سلامتها."
  },
  {
    id: 13,
    question: "هل يمكن استرجاع المبلغ بعد الحجز؟",
    answer: "نعم، يوجد سياسة إلغاء واسترجاع وفق شروط محددة."
  },
  {
    id: 14,
    question: "هل سوف يتم ابلاغ السلطات في حال كنت اعاني من الادمان على شيء معين؟",
    answer: "لا، لن يتم تبليغ أي جهة أو سلطة في حالات الإدمان، فخصوصيتك وحقك في السرية محفوظان تمامًا. ومع ذلك، في حال تبين وجود خطر جدي ومباشر على حياتك أو حياة الآخرين، فقد نضطر لاتخاذ إجراءات مناسبة لضمان السلامة، وذلك بما يتوافق مع القوانين الأخلاقية والمعايير الطبية."
  },
  {
    id: 15,
    question: "هل أستطيع التواصل مع مختصي بشكل مباشر؟",
    answer: "نعم، يمكنك المراسلة عبر الدردشة الآمنة المتاحة في حسابك."
  }
];

export default faqData;
